{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Bachelor of Software Engineering (Honours)",
      "department": "Engineering and Applied Science",
      "duration": "2017-2022",
      "school_name": "Ontario Tech University"
    }
  ],
  "github_repo_root_url": "https://github.com/Jarvis-Consulting-Group/jarvis_data_eng-RaminSamii.git",
  "highlighted_projects": [
    {
      "description": "Designed and created a web application depicting a Health-Care system with personalized user experience for patient and client side. The concept was generated during the peak of Covid-19 virus in 2021. The application mimiced essential elements of a visit to the specialist's office while lessening however much human contact as could be expected. Enabled login validation using Cloud Firestore database. Implemented a video call experience between patient and doctor using Web Real-Time Communication (WebRTC) API on JavaScript. A peer-to peer virtual connection was setup up from doctor's end through signalling and generating a Session Description Protocol (SDP) offer and a code which would get stored in Firebase. The code was accesible for the patient on the web interface to join the Video Call appointment.",
      "git_url": null,
      "name": "Web based Cloud HealthCare Service System"
    },
    {
      "description": "Developed a database management system using SQL. The hotel had multiple rooms and floors, and these rooms were of different types. The system was managed by hotel employees by a web framework using HTML and CSS. The database was connected to the web app with PHP. Employees were able to query from the web app to register guests for check ins, check for available rooms, assign rooms from the available rooms directory, mark if a guest requires housekeeping, and check guests out.",
      "git_url": null,
      "name": "Hotel Database Management System"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Responsibly designed and implemented a Linux based Minimum Viable Product (MVP) that caters to the specific business requirements of the Linux Cluster Administration team at Jarvis. As a developer I efficiently created Bash scripts generting records of hardware specifications of 10 servers and monitored node resource usage. The collected data was stored using PostgreSQL in real-time and the database was provisioned using Docker.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": "Successfully designed a Database management system to apply SQL optimization. The project incorporated CRUD operations and entailed understanding of data modeling strategies to ensure quality data governance. As a developer I loaded and distributed sample data among the database in three tables tracking values associated with each member, booking, and facility. The database was tested with SQL queries to access and manipulate various pieces of information.",
      "git_url": "/sql",
      "name": "RDBMS and SQL"
    },
    {
      "description": [
        "JDBC App: The JDBC application is a system for performing CRUD operations (Create, Read, Update, Delete) on a database, utilizing the JDBC API. It integrates a PostgreSQL database within a Docker container, with Maven, and Git as the chosen version control system.",
        "Grep App: The Grep project recreates the Linux GREP command, which provides users an aid to be able  search for Strings in a file or a directory. The application offers two approaches for pattern searching.The regular appoach uses file I/O for regular sized files. The second approach uses Java Streams and functional programming to handle huge files. The application was also Dockerized, and pushed online to the docker hub where we can view the images."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "Ramin Sami",
  "others": [
    {
      "bullets": [
        "Regularly engage in strength training, cardio workouts, and yoga to maintain a healthy lifestyle. Regularly attend classes, maintain a daily meditation practice, and apply principles of mindfulness to enhance focus and productivity in both personal and professional settings."
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Enthusiastic player of a wide range of board games, from complex strategy games like Risk to collaborative team games like Codenames. Participate in local game nights, honing strategic thinking, communication, and adaptability through various game scenarios."
      ],
      "title": "Awards"
    },
    {
      "bullets": [
        "Avid road trip traveler who has explored diverse cultures across Ontario. Proficient in trip planning, budget management, and problem-solving during extended journeys, fostering adaptability and a strong sense of adventure. "
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Developed, analyzed, and modified programming systems, which involved tasks such as encoding, testing, and debugging. Gained valuable experience working with diverse arrays of large data sets and large-scale data platforms. Following agile methodologies and utilizing git-flow, successfully developed applications that ran within Docker containers. Actively contributed to code-review sessions, ensuring that the code quality aligned with the specific business and project requirements.",
      "duration": "2023-present",
      "title": "Software Developer"
    },
    {
      "company": "Zebra Robotics",
      "description": "Taught 100+ students (grades 5-12) HTML, CSS, Python, JavaScript and Java. Delivered STEM based curricula to students of various ages, and periodically helped create said curricula. Acted as one of the lead delivery facilitators for workshops and modules.",
      "duration": "2022-2023",
      "title": "Programming Instructor"
    },
    {
      "company": "Finaeo Inc.",
      "description": "Managed development projects through completion, optimizing all cross-browser and multiplatform compatibility. Gained technical development skills such as JavaScript/TypeScript as well as Git and other workflow experience. Managed time-sensitive updates, including content changes and upgrades. Provided input to the continual development of tooling and reporting to add tangible business benefits. ",
      "duration": "2021",
      "title": "Full Stack Developer"
    }
  ],
  "skills": {
    "competent": [
      "Linux/Bash",
      "JavaScript/TypeScript",
      "HTML",
      "CSS/Bootstrap",
      "ReactJS",
      "Jira"
    ],
    "familiar": [
      "JQuery",
      "Kotlin",
      "C#",
      "C/C++",
      "PHP"
    ],
    "proficient": [
      "Java",
      "Python",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "I am a highly motivated software engineering graduate from Ontario Tech University with a fundamental knowledge of software design, development, and testing. I started learning Java earlier in high school. Being the only girl in my programming class was a huge motivation for me to keep moving forward. Throughout my degree, I designed and developed projects incorporating data structures, artificial intelligence, and embedded systems that I am proud of. I once created a Python program using TensorFlow which allowed the user to generate an outfit by type. The model was trained using Keras API to classify images. I enjoy developing games on Python, Java, and C# in my free time. A few games I'm exceptionally proud of are Snake Game, Whack-A-Mole, Tic-Tac-Toe, and Sudoku. With a strong foundation in software engineering principles and hands-on experience in various programming languages. I am eager to collaborate with talented individuals and contribute to a team-driven environment that fosters creativity and growth."
}
